let name = '주니하랑';

let hello = '안녕하세요. ' + name + '\ \
입니다! 코딩은 너무 재밌어요!' + name + '은 만능 개발자가 꿈인 것이에요. 너무 하고 싶은게 많아서 고민이네요. ' + name + '은 음악도 좋아해요! 음악도 만들고, 부르고, 드럼도 넘나 사랑하는 것이에요.';

console.log(hello);
console.log('=====================================');
let a = 1;      // 숫자 1은 숫자라는 Data를 표현하는 리터럴
let b = '1';    // 문자 1은 문자라는 Data를 표현하는 리터럴


let helloJunyHarang = `안녕하세요. ${name} 입니다! 

코딩은 너무 재밌어요! ${name}은 만능 개발자가 꿈인 것이에요. 너무 하고 싶은게 많아서 고민이네요. ${name}은 음악도 좋아해요! 음악도 만들고, 부르고, 드럼도 넘나 사랑하는 것이에요.`;

console.log(helloJunyHarang);